app/controllers/cohorts_controller.rb

  def index
    @cohorts = Cohort.all
---
SELECT "cohorts".* FROM "cohorts"