app/controllers/members_controller.rb

  def create
    @member = Member.new(member_params)
    @member.user_id=session[:user_id]

    if @member.save
---
INSERT INTO "members" ("name", "user_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "patrick"], ["user_id", 1], ["project_id", 1], ["created_at", "2022-11-01 15:32:00.187497"], ["updated_at", "2022-11-01 15:32:00.187497"]]