app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "category", "description", "github_link", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @project = Project.new(project_params)
    @project.user_id=session[:user_id]

    if @project.save

UPDATE "projects" SET "github_link" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["github_link", "fffffvfv"], ["updated_at", "2022-11-02 05:05:44.666033"], ["id", 2]]
---
  def update
  if
      @project.update(project_params)