app/controllers/users_controller.rb

    def index
      render json: User.all, status: :ok
---
SELECT "users".* FROM "users"

    def create
      user = User.create!(user_params)
---
INSERT INTO "users" ("username", "password_digest", "last_name", "role", "cohort_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def destroy
        res = User.find(params[:id])
        res.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]